#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on outputs.tf line 2, in output "website_url":
   2:   value = aws_s3_bucket.my-static-website.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.static_site: Refreshing state... [id=bucket-deploys3-angular-vapc-1098824]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.my-static-website will be created
  + resource "aws_s3_bucket" "my-static-website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "deploy-s3-app-angular-vapc-1098824939"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "my-static-website"
        }
      + tags_all                    = {
          + "Name" = "my-static-website"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.static_site will be destroyed
  # (because aws_s3_bucket.static_site is not in configuration)
  - resource "aws_s3_bucket" "static_site" {
      - arn                         = "arn:aws:s3:::bucket-deploys3-angular-vapc-1098824" -> null
      - bucket                      = "bucket-deploys3-angular-vapc-1098824" -> null
      - bucket_domain_name          = "bucket-deploys3-angular-vapc-1098824.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "bucket-deploys3-angular-vapc-1098824.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "bucket-deploys3-angular-vapc-1098824" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "bucket-deploys3-angular-vapc-1098824.s3-website-us-east-1.amazonaws.com" -> null

      - grant {
          - id          = "0b67cea04db7a0fbda9c4ae7b430b21b3afdd8d668621ce161c0cc76ea7bc796" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_acl.my-static-website will be created
  + resource "aws_s3_bucket_acl" "my-static-website" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.my-static-website will be created
  + resource "aws_s3_bucket_ownership_controls" "my-static-website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.my-static-website will be created
  + resource "aws_s3_bucket_public_access_block" "my-static-website" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_versioning.my-static-website will be created
  + resource "aws_s3_bucket_versioning" "my-static-website" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.my-static-website will be created
  + resource "aws_s3_bucket_website_configuration" "my-static-website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ website_url = "bucket-deploys3-angular-vapc-1098824.s3-website-us-east-1.amazonaws.com" -> (known after apply)

Warning: Deprecated attribute

  on outputs.tf line 2, in output "website_url":
   2:   value = aws_s3_bucket.my-static-website.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*